#+STARTUP: inlineimages
*** Ejemplo 2 - Definir una variable con set y asignarle una lista como valor
  #+BEGIN_SRC elisp :exports both
    ;; le asignamos a flower una lista
    ;; 'flower es una variable
    ;; y '(rosa violeta) es una lista con dos elementos
    (set 'flowers '(rosa violeta))

    ;; hacemos que retorne la lista que tiene la variable flowers
    flowers
  #+END_SRC

  #+RESULTS:
  | rosa | violeta |
*** Ejemplo 3 - Definir una variable con setq y asignarle una lista como valor
  #+BEGIN_SRC elisp :exports both
    ;; la q de setq hace referencia a quote osea cita
    ;; por tanto no es necesario citar el primer argumento carnivores con el apóstrofe
    ;;
    ;; mientras que con set solo, si habria que citar el primer argumento con el apóstrofe
    (setq carnivores '(lion tiger leopard))
    carnivores
  #+END_SRC

  #+RESULTS:
  | lion | tiger | leopard |
*** Ejemplo 4 - Declarando e inicializando multiples variables con setq
  #+BEGIN_SRC elisp :exports both
    ;; con setq podemos hacer multiples asignaciones
    (setq nombre "carlitos" edad 19)

    ;; usamos message para imprimir
    ;; usando los especificadore de formato %s (para string)
    ;; y %d (para constantes numéricas enteras)
    (message "su nombre es %s y su edad es %d" nombre edadd)
  #+END_SRC

  #+RESULTS:
  : su nombre es carlitos y su edad es 19

*** Ejemplo 5 - Declarando e inicializando multiples variables con setq
  #+BEGIN_SRC elisp :exports both
    ;; con setq podemos hacer multiples asignaciones
    ;; en este caso a carnivores una lista
    ;; y a hervivores otra lista
    (setq carnivoros '(lion tiger leopard)
          hervivoros '(gacela cebra))

    carnivoros
    hervivoros
  #+END_SRC

  #+RESULTS:
  | gacela | cebra |
*** Ejemplo 6 - Usar una variable como contador e incrementar su valor en 1
  #+BEGIN_SRC elisp :exports both
    ; declaramos la variable `contador' y la inicializamos en 0
    ; declaramos la variable `contador' e inicializamos en cero
    (setq contador 0)

    ; - incrementamos el valor actual en 1 usando la función para sumar (+ x y)
    ; - cada vez que hagamos `C-x C-e' incrementará en 1 la variable `contador'
    (setq contador (+ contador 1))

    ; imprimimos su valor
    contador
  #+END_SRC

  #+RESULTS:
  : 1
*** Ejemplo 2 - Lista de Constantes numéricas y Operadores como átomos
  #+BEGIN_SRC elisp :exports both
    '(+ 2 2)

    ; no confundir con la funcion (+ 2 2)
    ; el de arriba empieza con el apóstrofe, por tanto es una lista
  #+END_SRC

  #+RESULTS:
  | + | 2 | 2 |
*** Ejemplo 3 - Lista con saltos de linea
  #+BEGIN_SRC elisp :exports both
    '(rose
      violet
      daisy
      buttercup)
  #+END_SRC

  #+RESULTS:
  | rose | violet | daisy | buttercup |
*** Ejemplo 4 - Lista con espacios
  #+BEGIN_SRC elisp :exports both
    '(rose violet daisy buttercup)
  #+END_SRC

  #+RESULTS:
  | rose | violet | daisy | buttercup |
*** Ejemplo 5 - Lista con literales cadena cómo átomos
  #+BEGIN_SRC elisp :exports both
    '(esta lista tiene "un literal cadena" "otro string")
  #+END_SRC

  #+RESULTS:
  | esta | lista | tiene | un literal cadena | otro string |
*** Ejemplo 1 - Definimos dos variables locales al scope de let
  #+BEGIN_SRC elisp :exports both
    ;; let lleva como primer argumento una lista de clave-valor ((variableA valor) (variableB valor))
    ;; como segundo argumento un cuerpo de la función
    (let ((a "Soy a")(b "y yo soy b"))
      (message "Hi, %s. Hi %s" a b))
  #+END_SRC

  #+RESULTS:
  : Hello, I'm a. Hello I'm b
*** [TODO] Ejemplo 3
  #+BEGIN_SRC elisp :exports both
    ;; definimos una función que no recibe parámetros,
    ;; e imprime en el minibuffer el valor de `c'
    (defun funcion-loca ()
      (message "El valor de `c' es %s" c))

    (defvar c "tururu..")

    ;; Vemos que el valor de `c' no será el de arriba
    (let ((a "String de una variable local") (c "Sobreescribo la variable externa"))
      (funcion-loca)
      (message "El valor de `a' es: %s, y el de `c' es %s" a c))
  #+END_SRC

  #+RESULTS:
  : El valor de ‘a’ es: String de una variable local, y el de ‘c’ es Sobreescribo la variable externa
*** Ejemplo 4 - Variables con datos del buffer actual
  #+BEGIN_SRC elisp :exports both
    ;; let tiene una lista de clave-valor ((nombre1 valor1) (nombre2 valor2))
    ;; "en este caso valor1 y valor2 son funciones que retoran datos del buffer actual"
    ;; seguido de un cuerpo que es (message )
    (let ((foo (buffer-name)) (bar (buffer-size)))
      (message "Este buffer es %s y tiene %d caracteres." foo bar))
  #+END_SRC

  #+RESULTS:
  : Este buffer es README.org y tiene 12632 caracteres.
*** Ejemplo 1 - Obtener la ruta absoluta del buffer
  #+BEGIN_SRC elisp
    (buffer-file-name)
  #+END_SRC

  #+RESULTS:
  : /home/jelou/Documentos/git/aprende-elisp/test1.org
*** Ejemplo 2 - Obtener el nombre del buffer y su extensión
  #+BEGIN_SRC elisp
    (buffer-name)
  #+END_SRC

  #+RESULTS:
  : test1.org
*** Ejemplo 3 - Obtener el tamaño del buffer
  #+BEGIN_SRC elisp
    (buffer-size)
  #+END_SRC

  #+RESULTS:
  : 4953
*** Ejemplo 2 - Definir una función arimética que recibe un parámetro
  #+BEGIN_SRC elisp :exports both
    (defun multiplicar-por-siete (numero)
      "Esto es un comentario, y describimos que multiplica a `numero' por siete"
      (* 7 numero))

    (multiplicar-por-siete 3)
  #+END_SRC

  #+RESULTS:
  : 21
*** Ejemplo 3 - Parámetros de una función usados por otras funciones invocadas en ese scope
  #+BEGIN_SRC elisp
    (defun a-exists-only-in-my-body (a)
      (other-function))

    (defun other-function ()
      (message "I see `a', its value is %s" a))

    (a-exists-only-in-my-body 5)
  #+END_SRC

  #+RESULTS:
  : I see ‘a’, its value is 5
*** Ejemplo 4 - Definir la Función Recursiva Factorial
  #+BEGIN_SRC elisp :exports both
    ;; - Definimos una función recursiva porque se llama a si misma
    ;; - Caso base: Si n es cero, se corta la recursividad
    ;; - Caso recursivo: Si n no es cero, multiplica n veces el valor por valor-1
    (defun factorial (n)
      (if (= n 0)
          1
        (* n (factorial (- n 1)))))

    (factorial 5)
  #+END_SRC

  #+RESULTS:
  : 120

*** Ejemplo 2 - Concatenar resultados de funciones
  #+BEGIN_SRC elisp
    ;; pasamos funciones como argumentos
    ;; el (+ 1 2) es similar a haskell
    (concat "hola " (number-to-string (+ 1 2)) " xd")
  #+END_SRC

  #+RESULTS:
  : hola 3 xd
*** Ejemplo 1 - Imprimir un hola-mundo
  #+BEGIN_SRC elisp :exports both
    ;; funciona como un echo o print
    (message "hola mundo")
  #+END_SRC

  #+RESULTS:
  : hola mundo
*** Ejemplo 2 - Pasar argumentos y mostrarlos con especificadores de formato
  #+BEGIN_SRC elisp :exports both
    ;; usamos el %s como especificador de formato que representa un string
    (message "el nombre del buffer es %s" (buffer-name))
  #+END_SRC

  #+RESULTS:
  : el nombre del buffer es README.org
*** Ejemplo 3 - Pasar argumentos y mostrarlos con especificadores de formato
  #+BEGIN_SRC elisp
    ;; - es un formato similar al printf de C
    ;; - usamos los %s y %d como especificadores de formato
    ;; - %s para los literales cadena (string)
    ;; - %d para las constantes numéricas enteras
    (message "el nombre de buffer es %s y 100+100 es %d" (buffer-name) (+ 100 100))
  #+END_SRC

  #+RESULTS:
  : el nombre de buffer es README.org y 100+100 es 200
*** Ejemplo 1 - Condicional Simple y la funciones (>) y (message)
  #+BEGIN_SRC elisp
    ;; el (> 5 4) es como haskell, 5 es el primer agumento y 4 el segundo

    (if(> 5 4)             ;; criterio
        (message "wow, 5 es mayor que 4!"))  ;; resultado si se cumple
  #+END_SRC

  #+RESULTS:
  : wow, 5 es mayor que 4!
*** Ejemplo 2 - Definiendo una función con un Condicional Compuesto y las funciones (equal) y (message)
  #+BEGIN_SRC elisp
    (defun tipo-animal (tipo)                      ;; defun nombre (lista-argumentos)
      "Imprime un mensaje segun el tipo de animal" ;; "documentación", breve descripción de la función
      (if (equal tipo 'fiera)                      ;; cuerpo parte-si
          (message "Cuidado! Corré!")              ;; cuerpo parte-then
          (message "No es peligroso")))            ;; cuerpo parte-else

    (tipo-animal 'fiera)
    (tipo-animal 'cebrita)
  #+END_SRC

  #+RESULTS:
  : No es peligroso
* Otros
  #+BEGIN_SRC elisp
    ;; (point-min) devuelve la posición del cursor al principio de buffer
    ;; (point) devuelve la posición actual del cursor
    (message "Hay %d caracteres dentro de este buffer."
             (- (point)
                (save-excursion
                  (goto-char (point-min)) (point))))
  #+END_SRC

  #+RESULTS:
  : Hay 6289 caracteres dentro de este buffer.

  #+BEGIN_SRC elisp
    (defun hello (name)
      (insert (format "Hello %s!\n" name)))

    (hello "you")
  #+END_SRC

  #+BEGIN_SRC elisp
    (setq invitados '("carlos" "pepe"))

    (defun saludar(mi-nombre)
      (let ((tu-nombre (read-from-minibuffer "Enter your name: ")))
        (message "tu nombre es %s y yo soy %s" tu-nombre mi-nombre) )
      )

    ;;(saludar "perez")

    (mapcar 'saludar invitados)
  #+END_SRC

  #+RESULTS:
  | carlos | pepe |

